{
  "plugins": {
    "cmp-buffer": {
      "src": "https://github.com/hrsh7th/cmp-buffer",
      "version": "'b74fab3656eea9de20a9b8116afa3cfc4ec09657'"
    },
    "cmp-cmdline": {
      "src": "https://github.com/hrsh7th/cmp-cmdline",
      "version": "'d126061b624e0af6c3a556428712dd4d4194ec6d'"
    },
    "cmp-nvim-lsp": {
      "src": "https://github.com/hrsh7th/cmp-nvim-lsp",
      "version": "'cbc7b02bb99fae35cb42f514762b89b5126651ef'"
    },
    "cmp-nvim-lua": {
      "src": "https://github.com/hrsh7th/cmp-nvim-lua",
      "version": "'e3a22cb071eb9d6508a156306b102c45cd2d573d'"
    },
    "cmp-path": {
      "src": "https://github.com/hrsh7th/cmp-path",
      "version": "'c642487086dbd9a93160e1679a1327be111cbc25'"
    },
    "conform.nvim": {
      "src": "https://github.com/stevearc/conform.nvim",
      "version": "'v9.1.0'"
    },
    "copilot-lualine": {
      "src": "https://github.com/AndreM222/copilot-lualine",
      "version": "'main'"
    },
    "copilot.lua": {
      "src": "https://github.com/zbirenbaum/copilot.lua",
      "version": "'v2.0.2'"
    },
    "csvview.nvim": {
      "src": "https://github.com/hat0uma/csvview.nvim",
      "version": "'v1.3.0'"
    },
    "emoji.nvim": {
      "src": "https://github.com/allaman/emoji.nvim",
      "version": "'v6.0.2'"
    },
    "fidget.nvim": {
      "src": "https://github.com/j-hui/fidget.nvim",
      "version": "'7fa433a83118a70fe24c1ce88d5f0bd3453c0970'"
    },
    "fzf-lua": {
      "src": "https://github.com/ibhagwan/fzf-lua",
      "version": "'main'"
    },
    "gitsigns.nvim": {
      "src": "https://github.com/lewis6991/gitsigns.nvim",
      "version": "'v2.1.0'"
    },
    "indent-blankline.nvim": {
      "src": "https://github.com/lukas-reineke/indent-blankline.nvim",
      "version": "'v3.9.1'"
    },
    "kulala.nvim": {
      "src": "https://github.com/mistweaverco/kulala.nvim",
      "version": "'v5.3.4'"
    },
    "lsp-format.nvim": {
      "src": "https://github.com/lukas-reineke/lsp-format.nvim",
      "version": "'42d1d3e407c846d95f84ea3767e72ed6e08f7495'"
    },
    "lualine.nvim": {
      "src": "https://github.com/nvim-lualine/lualine.nvim",
      "version": "'master'"
    },
    "mason-lspconfig.nvim": {
      "src": "https://github.com/williamboman/mason-lspconfig.nvim",
      "version": "'v2.1.0'"
    },
    "mason-tool-installer.nvim": {
      "src": "https://github.com/WhoIsSethDaniel/mason-tool-installer.nvim",
      "version": "'master'"
    },
    "mason.nvim": {
      "src": "https://github.com/williamboman/mason.nvim",
      "version": "'v2.2.1'"
    },
    "mini.hipatterns": {
      "src": "https://github.com/echasnovski/mini.hipatterns",
      "version": "'v0.17.0'"
    },
    "mini.indentscope": {
      "src": "https://github.com/echasnovski/mini.indentscope",
      "version": "'v0.17.0'"
    },
    "mini.move": {
      "src": "https://github.com/echasnovski/mini.move",
      "version": "'v0.17.0'"
    },
    "mini.splitjoin": {
      "src": "https://github.com/echasnovski/mini.splitjoin",
      "version": "'v0.17.0'"
    },
    "nvim-cmp": {
      "src": "https://github.com/hrsh7th/nvim-cmp",
      "version": "'da88697d7f45d16852c6b2769dc52387d1ddc45f'"
    },
    "nvim-lint": {
      "src": "https://github.com/mfussenegger/nvim-lint",
      "version": "'bcd1a44edbea8cd473af7e7582d3f7ffc60d8e81'"
    },
    "nvim-lspconfig": {
      "src": "https://github.com/neovim/nvim-lspconfig",
      "version": "'d1597791f8196519439b3a036b59b09023981e1d'"
    },
    "nvim-tree.lua": {
      "src": "https://github.com/nvim-tree/nvim-tree.lua",
      "version": "'v1.17.0'"
    },
    "nvim-web-devicons": {
      "src": "https://github.com/nvim-tree/nvim-web-devicons",
      "version": "'master'"
    },
    "plenary.nvim": {
      "src": "https://github.com/nvim-lua/plenary.nvim",
      "version": "'master'"
    },
    "telescope.nvim": {
      "src": "https://github.com/nvim-telescope/telescope.nvim",
      "version": "'ad7d9580338354ccc136e5b8f0aa4f880434dcdc'"
    },
    "tiny-inline-diagnostic.nvim": {
      "src": "https://github.com/rachartier/tiny-inline-diagnostic.nvim",
      "version": "'main'"
    },
    "trouble.nvim": {
      "src": "https://github.com/folke/trouble.nvim",
      "version": "'v3.7.1'"
    },
    "vim-surround": {
      "src": "https://github.com/tpope/vim-surround",
      "version": "'v2.2'"
    },
    "which-key.nvim": {
      "src": "https://github.com/folke/which-key.nvim",
      "version": "'3aab2147e74890957785941f0c1ad87d0a44c15a'"
    }
  }
}
